### high dimensional data-pandas
#### 1. Series - one column data  <br>
#### 2. DataFrame - number of columns

In [1]:
import pandas as pd
import numpy as np

In [3]:
# create series obj:one column
s1 = pd.Series([10,20,30,40,50])
print(type(s1))
print(s1)

<class 'pandas.core.series.Series'>
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
s2 = pd.Series(np.array(["apple","banana","mango","orange"]))
print(type(s2))
print(s2)

<class 'pandas.core.series.Series'>
0     apple
1    banana
2     mango
3    orange
dtype: object

In [7]:
d = {'a':10,'b':20,'c':30}
s3 = pd.Series(d)
print(s3)

a    10
b    20
c    30
dtype: int64

In [9]:
s3[2:3]

c    30
dtype: int64

In [11]:
l = [10,20,30,40,50]
s3 = pd.Series(l,index=[3,4,5,6,7])
print(s3)

3    10
4    20
5    30
6    40
7    50
dtype: int64

In [13]:
s3 = pd.Series(l,index=['a','b','c','d','e'])
print(s3)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [14]:
s3.shape

(5,)

In [15]:
s3.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [16]:
s3.nbytes

40

In [17]:
s3.hasnans

False

In [18]:
sn = pd.Series(["hello",np.nan,20,30,False,10.23,"hai",np.nan])
print(sn)

0    hello
1      NaN
2       20
3       30
4    False
5    10.23
6      hai
7      NaN
dtype: object

In [19]:
#true if any element is nan
sn.hasnans

True

In [20]:
### DataFrame - multiple columns
df = pd.DataFrame([[12,32,45,32,46],[20,30,41,52,56]])
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
    0   1   2   3   4
0  12  32  45  32  46
1  20  30  41  52  56

In [21]:
df = pd.DataFrame({'subject':['maths','english','science'],'marks':[12,32,45]})
print(df)

   subject  marks
0    maths     12
1  english     32
2  science     45

In [22]:
df = pd.DataFrame({'subject':pd.Series(['maths','english','science']),'marks':pd.Series([12,32,45])})
print(df)

   subject  marks
0    maths     12
1  english     32
2  science     45

In [23]:
df['names']=['ravi','kiran','minnu']
df

   subject  marks  names
0    maths     12   ravi
1  english     32  kiran
2  science     45  minnu

In [25]:
#delete
del df['names']
df

   subject  marks
0    maths     12
1  english     32
2  science     45

In [26]:
df.size

6

In [29]:
df.shape

(3, 2)

In [32]:
df['marks'].hasnans

False

In [33]:
df.columns

Index(['subject', 'marks'], dtype='object')

In [35]:
data = pd.read_csv("Data/hotel_bookings.csv")
data.head()

,hotel,is_canceled,lead_time,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,...,deposit_type,agent,company,days_in_waiting_list,customer_type,adr,required_car_parking_spaces,total_of_special_requests,reservation_status,reservation_status_date
0,Resort Hotel,0,342,2015,July,27,1,0,0,2,...,No Deposit,NaN,NaN,0,Transient,0.0,0,0,Check-Out,2015-07-01
1,Resort Hotel,0,737,2015,July,27,1,0,0,2,...,No Deposit,NaN,NaN,0,Transient,0.0,0,0,Check-Out,2015-07-01
2,Resort Hotel,0,7,2015,July,27,1,0,1,1,...,No Deposit,NaN,NaN,0,Transient,75.0,0,0,Check-Out,2015-07-02
3,Resort Hotel,0,13,2015,July,27,1,0,1,1,...,No Deposit,304.0,NaN,0,Transient,75.0,0,0,Check-Out,2015-07-02
4,Resort Hotel,0,14,2015,July,27,1,0,2,2,...,No Deposit,240.0,NaN,0,Transient,98.0,0,1,Check-Out,2015-07-03

In [36]:
data.columns.values

array(['hotel', 'is_canceled', 'lead_time', 'arrival_date_year',
       'arrival_date_month', 'arrival_date_week_number',
       'arrival_date_day_of_month', 'stays_in_weekend_nights',
       'stays_in_week_nights', 'adults', 'children', 'babies', 'meal',
       'country', 'market_segment', 'distribution_channel',
       'is_repeated_guest', 'previous_cancellations',
       'previous_bookings_not_canceled', 'reserved_room_type',
       'assigned_room_type', 'booking_changes', 'deposit_type', 'agent',
       'company', 'days_in_waiting_list', 'customer_type', 'adr',
       'required_car_parking_spaces', 'total_of_special_requests',
       'reservation_status', 'reservation_status_date'], dtype=object)

In [37]:
data.dtypes

hotel                              object
is_canceled                         int64
lead_time                           int64
arrival_date_year                   int64
arrival_date_month                 object
arrival_date_week_number            int64
arrival_date_day_of_month           int64
stays_in_weekend_nights             int64
stays_in_week_nights                int64
adults                              int64
children                          float64
babies                              int64
meal                               object
country                            object
market_segment                     object
distribution_channel               object
is_repeated_guest                   int64
previous_cancellations              int64
previous_bookings_not_canceled      int64
reserved_room_type                 object
assigned_room_type                 object
booking_changes                     int64
deposit_type                       object
agent                             float64
company                           float64
days_in_waiting_list                int64
customer_type                      object
adr                               float64
required_car_parking_spaces         int64
total_of_special_requests           int64
reservation_status                 object
reservation_status_date            object
dtype: object

In [39]:
data[['reservation_status','reservation_status_date']]

       reservation_status reservation_status_date
0               Check-Out              2015-07-01
1               Check-Out              2015-07-01
2               Check-Out              2015-07-02
3               Check-Out              2015-07-02
4               Check-Out              2015-07-03
...                   ...                     ...
119385          Check-Out              2017-09-06
119386          Check-Out              2017-09-07
119387          Check-Out              2017-09-07
119388          Check-Out              2017-09-07
119389          Check-Out              2017-09-07

[119390 rows x 2 columns]

In [40]:
data.reservation_status_date.dtype

dtype('O')

In [41]:
data['adr']

0           0.00
1           0.00
2          75.00
3          75.00
4          98.00
           ...
119385     96.14
119386    225.43
119387    157.71
119388    104.40
119389    151.20
Name: adr, Length: 119390, dtype: float64

In [42]:
del data['adr']

In [43]:
data.columns

Index(['hotel', 'is_canceled', 'lead_time', 'arrival_date_year',
       'arrival_date_month', 'arrival_date_week_number',
       'arrival_date_day_of_month', 'stays_in_weekend_nights',
       'stays_in_week_nights', 'adults', 'children', 'babies', 'meal',
       'country', 'market_segment', 'distribution_channel',
       'is_repeated_guest', 'previous_cancellations',
       'previous_bookings_not_canceled', 'reserved_room_type',
       'assigned_room_type', 'booking_changes', 'deposit_type', 'agent',
       'company', 'days_in_waiting_list', 'customer_type',
       'required_car_parking_spaces', 'total_of_special_requests',
       'reservation_status', 'reservation_status_date'],
      dtype='object')

In [44]:
data.describe()

,is_canceled,lead_time,arrival_date_year,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,children,babies,is_repeated_guest,previous_cancellations,previous_bookings_not_canceled,booking_changes,agent,company,days_in_waiting_list,required_car_parking_spaces,total_of_special_requests
count,119390.000000,119390.000000,119390.000000,119390.000000,119390.000000,119390.000000,119390.000000,119390.000000,119386.000000,119390.000000,119390.000000,119390.000000,119390.000000,119390.000000,103050.000000,6797.000000,119390.000000,119390.000000,119390.000000
mean,0.370416,104.011416,2016.156554,27.165173,15.798241,0.927599,2.500302,1.856403,0.103890,0.007949,0.031912,0.087118,0.137097,0.221124,86.693382,189.266735,2.321149,0.062518,0.571363
std,0.482918,106.863097,0.707476,13.605138,8.780829,0.998613,1.908286,0.579261,0.398561,0.097436,0.175767,0.844336,1.497437,0.652306,110.774548,131.655015,17.594721,0.245291,0.792798
min,0.000000,0.000000,2015.000000,1.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,6.000000,0.000000,0.000000,0.000000
25%,0.000000,18.000000,2016.000000,16.000000,8.000000,0.000000,1.000000,2.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,9.000000,62.000000,0.000000,0.000000,0.000000
50%,0.000000,69.000000,2016.000000,28.000000,16.000000,1.000000,2.000000,2.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,14.000000,179.000000,0.000000,0.000000,0.000000
75%,1.000000,160.000000,2017.000000,38.000000,23.000000,2.000000,3.000000,2.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,229.000000,270.000000,0.000000,0.000000,1.000000
max,1.000000,737.000000,2017.000000,53.000000,31.000000,19.000000,50.000000,55.000000,10.000000,10.000000,1.000000,26.000000,72.000000,21.000000,535.000000,543.000000,391.000000,8.000000,5.000000

In [46]:
data.select_dtypes(include=object).count()

hotel                      119390
arrival_date_month         119390
meal                       119390
country                    118902
market_segment             119390
distribution_channel       119390
reserved_room_type         119390
assigned_room_type         119390
deposit_type               119390
customer_type              119390
reservation_status         119390
reservation_status_date    119390
dtype: int64

In [54]:
data['country'].value_counts()

PRT    48590
GBR    12129
FRA    10415
ESP     8568
DEU     7287
       ...
BDI        1
AIA        1
DMA        1
HND        1
PYF        1
Name: country, Length: 177, dtype: int64

In [48]:
titanic = pd.read_csv("Data/train-titanic.csv")

In [49]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [55]:
df_t = pd.read_csv("https://raw.githubusercontent.com/agconti/kaggle-titanic/master/data/train.csv")
df_t.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [56]:
df_t.describe(include=[np.object])

                        Name   Sex  Ticket    Cabin Embarked
count                    891   891     891      204      889
unique                   891     2     681      147        3
top     Slabenoff, Mr. Petco  male  347082  B96 B98        S
freq                       1   577       7        4      644

In [57]:
df_t.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [58]:
df_t.Survived.unique()

array([0, 1], dtype=int64)

In [60]:
df_t.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [61]:
df_t.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [62]:
df_t.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [63]:
df_t.Cabin.nunique()

147

In [64]:
len(df_t.Cabin.unique())

148

In [65]:
df_t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [66]:
df_t['Fare'].apply(np.ceil)

0       8.0
1      72.0
2       8.0
3      54.0
4       9.0
       ...
886    13.0
887    30.0
888    24.0
889    30.0
890     8.0
Name: Fare, Length: 891, dtype: float64

In [67]:
df_t['Fare'].apply(np.floor)

0       7.0
1      71.0
2       7.0
3      53.0
4       8.0
       ...
886    13.0
887    30.0
888    23.0
889    30.0
890     7.0
Name: Fare, Length: 891, dtype: float64

In [70]:
df_t[df_t['Cabin'].isna()].index

Int64Index([  0,   2,   4,   5,   7,   8,   9,  12,  13,  14,
            ...
            878, 880, 881, 882, 883, 884, 885, 886, 888, 890],
           dtype='int64', length=687)

In [71]:
df_t['Cabin'].mode()

0        B96 B98
1    C23 C25 C27
2             G6
dtype: object

In [80]:
df_t['Cabin'] = df_t['Cabin'].fillna(df_t['Cabin'].mode()[0])

In [81]:
df_t['Cabin'].isnull().sum()

0

In [82]:
df_t1 = df_t.copy()

In [83]:
df_t.shape

(891, 12)

In [84]:
df_drop = df_t1.dropna()

In [76]:
df_drop.shape

(185, 12)

In [86]:
d = pd.DataFrame({"name":['sita','rama','ravi','kiran'],"marks":[10,20,30,42]})
d.to_json("sample.json")

In [87]:
rd = pd.read_json("sample.json")
print(rd)

    name  marks
0   sita     10
1   rama     20
2   ravi     30
3  kiran     42

In [90]:
rd.columns

Index(['name', 'marks'], dtype='object')

In [92]:
rd.values.tolist()

[['sita', 10], ['rama', 20], ['ravi', 30], ['kiran', 42]]

In [95]:
names = ["col1","col2"]

In [96]:
rd.columns = names

In [97]:
rd

    col1  col2
0   sita    10
1   rama    20
2   ravi    30
3  kiran    42